Tekla.Structures.Catalogs.PrinterItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type ProfileItem.